

  if ('serviceWorker' in navigator) {
  window.addEventListener('load', function() {
    navigator.serviceWorker.register('/sw.js').then(function(registration) {
      console.log('ServiceWorker registration successful with scope: ', registration.scope);
    }, function(err) {
      console.log('ServiceWorker registration failed: ', err);
    });
  });
}


$( window ).resize(function() {
  var c_m = $('.owl-carousel');
  if((window.innerHeight > window.innerWidth) || (window.innerWidth < 993)){
    $("#main_owl").removeClass("owl-carousel");
  } else{
    $("#main_owl").addClass("owl-carousel");
    c_m.owlCarousel({
      singleItem: true,
      items: 1,
      addClassActive: true,
      autoplay: false,
      navigation: false,
      navigationText: false,
      paginationNumbers: false,
      slideSpeed: 1000,
      afterMove: function(e) {
        var i = this.currentItem + 1;
        if (i == 2) {
          $('.first').removeClass('active');
          $('.second').addClass('active');
        } else if (i == 1) {
          $('.first').addClass('active');
          $('.second').removeClass('active');
        }
      }
    });
  }
});
$(document).on('closed', '.remodal', function (e) {
  var inst = $(this).remodal();
  inst.destroy();
});
$(document).on('opened', '.remodal', function (e) {
  $(".owl-test").owlCarousel(
    {
      singleItem: true,
      items: 1,
      addClassActive: true,
      autoPlay: true,
      stopOnHover: true,
      navigation: false,
      navigationText: false,
      paginationNumbers: false,
      slideSpeed: 700
    }
  );
});


function opener(el){
  var n = $(el).data("name");
  switch (n) {
    case 'kids': riot.mount('land', {title: 'Kids camp',
                                    subtitle: 'crossind borders to new discoveries',
                                    img: 'line',
                                    text1: 'Ти втомився гребти та шукаєш попутний вітер? Табір Cross Winds - ковток свіжого повітря для твоїх вітрил. Ми допоможемо тобі побачити наскільки яскравим може бути життя на фоні сірих буднів. Ми пропонуємо тобі:',
                                    offer1: 'Думаєш, що вивчення англійської - це нудно? Наші заняття знищать твої стереотипи. Пропонуємо спеціально розроблені нашими вчителями уроки англійської мови, а також практику розмовної мови з командою американців.',
                                    offer2: 'Не можеш розібратись у собі? Давай разом знайдемо відповіді на життєві питання, що тебе турбують.',
                                    offer3: 'Живеш як на безлюдному острові? Ласкаво просимо в нашу дружню інтернаціональну команду. Зав`язуй дружбу з іноземцями, дізнайся багато нового про культуру інших народів.',
                                    offer4: 'Не знаєш як цікаво та з користю провести час? Даруємо тобі море ідей та вражень. На території табору буде діяти 6 різноманітних студій та майстер-класів, спробуй себе в чомусь новому. Обери майстер класи зі списку при реєстрації.',
                                    offer5: 'Не вистачає адреналіну? Стань учасником веселих командних змагань.  P.S. На переможців чекають американські смаколики.',
                                    offer6: 'Хочеш стати зіркою? Наш небозвід відкритий для тебе. В кінці кожного заїзду ми проводимо талант шоу, де кожен може показати все, що вміє.',
                                    info1: 'Денний табір на базі Боярської школи №5  ( + команда з 18-ти американців)',
                                    info2: 'Буде проходити з 12 по 17 червня (6 днів)',
                                    info3: '700 грн. (включно з обідом та снеками)'
                                  });
                                break;
    case 'winter': riot.mount('land', {title: 'Winter camp',
                                      subtitle: 'crossind borders to new discoveries',
                                      img: 'winter',
                                      text1: 'Ти втомився гребти та шукаєш попутний вітер? Табір Cross Winds - ковток свіжого повітря для твоїх вітрил. Ми допоможемо тобі побачити наскільки яскравим може бути життя на фоні сірих буднів. Ми пропонуємо тобі:',
                                      offer1: 'Думаєш, що вивчення англійської - це нудно? Наші заняття знищать твої стереотипи. Пропонуємо спеціально розроблені нашими вчителями уроки англійської мови, а також практику розмовної мови з командою американців.',
                                      offer2: 'Не можеш розібратись у собі? Давай разом знайдемо відповіді на життєві питання, що тебе турбують.',
                                      offer3: 'Живеш як на безлюдному острові? Ласкаво просимо в нашу дружню інтернаціональну команду. Зав`язуй дружбу з іноземцями, дізнайся багато нового про культуру інших народів.',
                                      offer4: 'Не знаєш як цікаво та з користю провести час? Даруємо тобі море ідей та вражень. На території табору буде діяти 6 різноманітних студій та майстер-класів, спробуй себе в чомусь новому. Обери майстер класи зі списку при реєстрації.',
                                      offer5: 'Не вистачає адреналіну? Стань учасником веселих командних змагань.  P.S. На переможців чекають американські смаколики.',
                                      offer6: 'Хочеш стати зіркою? Наш небозвід відкритий для тебе. В кінці кожного заїзду ми проводимо талант шоу, де кожен може показати все, що вміє.',
                                      info1: 'Денний табір на базі Боярської школи №5  ( + команда з 18-ти американців)',
                                      info2: 'Буде проходити з 12 по 17 червня (6 днів)',
                                      info3: '700 грн. (включно з обідом та снеками)'
                                    });
                                  break;
    case 'away': riot.mount('land', {title: 'Away camp',
                                    subtitle: 'crossind borders to new discoveries',
                                    img: 'away',
                                    text1: 'Ти втомився гребти та шукаєш попутний вітер? Табір Cross Winds - ковток свіжого повітря для твоїх вітрил. Ми допоможемо тобі побачити наскільки яскравим може бути життя на фоні сірих буднів. Ми пропонуємо тобі:',
                                    offer1: 'Думаєш, що вивчення англійської - це нудно? Наші заняття знищать твої стереотипи. Пропонуємо спеціально розроблені нашими вчителями уроки англійської мови, а також практику розмовної мови з командою американців.',
                                    offer2: 'Не можеш розібратись у собі? Давай разом знайдемо відповіді на життєві питання, що тебе турбують.',
                                    offer3: 'Живеш як на безлюдному острові? Ласкаво просимо в нашу дружню інтернаціональну команду. Зав`язуй дружбу з іноземцями, дізнайся багато нового про культуру інших народів.',
                                    offer4: 'Не знаєш як цікаво та з користю провести час? Даруємо тобі море ідей та вражень. На території табору буде діяти 6 різноманітних студій та майстер-класів, спробуй себе в чомусь новому. Обери майстер класи зі списку при реєстрації.',
                                    offer5: 'Не вистачає адреналіну? Стань учасником веселих командних змагань.  P.S. На переможців чекають американські смаколики.',
                                    offer6: 'Хочеш стати зіркою? Наш небозвід відкритий для тебе. В кінці кожного заїзду ми проводимо талант шоу, де кожен може показати все, що вміє.',
                                    info1: 'Виїзний табір на базі с.Скригалівка Фастівський р-н ( + команда з 12-ти американців)',
                                    info2: 'Буде проходити з 14 по 21 червня (8 днів)',
                                    info3: '700 грн. (включно з обідом та снеками)'
                                  });
                                break;
    case 'day': riot.mount('land', {title: 'Day camp',
                                    subtitle: 'crossind borders to new discoveries',
                                    img: 'line',
                                    text1: 'Ти втомився гребти та шукаєш попутний вітер? Табір Cross Winds - ковток свіжого повітря для твоїх вітрил. Ми допоможемо тобі побачити наскільки яскравим може бути життя на фоні сірих буднів. Ми пропонуємо тобі:',
                                    offer1: 'Думаєш, що вивчення англійської - це нудно? Наші заняття знищать твої стереотипи. Пропонуємо спеціально розроблені нашими вчителями уроки англійської мови, а також практику розмовної мови з командою американців.',
                                    offer2: 'Не можеш розібратись у собі? Давай разом знайдемо відповіді на життєві питання, що тебе турбують.',
                                    offer3: 'Живеш як на безлюдному острові? Ласкаво просимо в нашу дружню інтернаціональну команду. Зав`язуй дружбу з іноземцями, дізнайся багато нового про культуру інших народів.',
                                    offer4: 'Не знаєш як цікаво та з користю провести час? Даруємо тобі море ідей та вражень. На території табору буде діяти 6 різноманітних студій та майстер-класів, спробуй себе в чомусь новому. Обери майстер класи зі списку при реєстрації.',
                                    offer5: 'Не вистачає адреналіну? Стань учасником веселих командних змагань.  P.S. На переможців чекають американські смаколики.',
                                    offer6: 'Хочеш стати зіркою? Наш небозвід відкритий для тебе. В кінці кожного заїзду ми проводимо талант шоу, де кожен може показати все, що вміє.',
                                    info1: 'Денний табір на базі Боярської школи №5  ( + команда з 18-ти американців)',
                                    info2: 'Буде проходити з 12 по 17 червня (6 днів)',
                                    info3: '700 грн. (включно з обідом та снеками)'
                                  });
                                break;
  }
  var i = $('[data-remodal-id=land]').remodal();
  i.open();
}
